[{"repoName": "dataModel.Alert", "repoLink": "https://github.com/smart-data-models/dataModel.Alert.git", "dataModel": "alert", "descriptionAvailable": [], "descriptionMissing": ["subCategory"]},
 {"repoName": "dataModel.Battery", "repoLink": "https://github.com/smart-data-models/dataModel.Battery.git", "dataModel": "Battery", "descriptionAvailable": [{"acPowerInput": "A measurement at input present only present if the battery work with AC. This is like the consumption measurement for the battery."},
 {"acPowerOutput": "A measurement present only if battery gives output in AC"},
 {"autonomyTime": "time duration expressed in 8601 duration until drain battery."},
 {"cicleLife": "A number of reference of discharge-charge cycles until the battery decrease its performance"},
 {"dataProvider": "Specifies the URL to information about the provider of this information."},
 {"dcPowerInput": "A measurement at input present only present if the battery work with DC. This is like the consumption measurement for the battery."},
 {"dcPowerOutput": "A measurement present only if battery gives output in DC"},
 {"location": "The current location of the item"},
 {"rechargeTime": "Time duration expressed in 8601 duration until re fill 100 the battery."},
 {"refDevice": "A reference to the device(s) Entity device which it use this battery."},
 {"source": "A sequence of characters giving the source of the entity data"},
 {"status": "Status of the battery. Allowed values: (`working`, `outOfService`, `withIncidence`)"}], "descriptionMissing": []},
 {"repoName": "dataModel.Battery", "repoLink": "https://github.com/smart-data-models/dataModel.Battery.git", "dataModel": "BatteryStatus", "descriptionAvailable": [{"acPowerInput": "A instantaneous measurement at input present only present if the battery work with AC. This is like the consumption measurement for the battery. Default unit: KWT, The unit code (text) of measurement given using the UN/CEFACT Common Code (max. 3 characters)."},
 {"acPowerOutput": "A instantaneous measurement present only if battery gives output in AC. Default unit: KWT, The unit code (text) of measurement given using the UN/CEFACT Common Code (max. 3 characters)."},
 {"dataProvider": "Specifies the URL to information about the provider of this information."},
 {"dateObserved": "The date and time of this observation in ISO8601 UTCformat. It can be represented by an specific time instant or by an ISO8601 interval."},
 {"dcPowerInput": "A instantaneous measurement present only if battery take input in DC. This is like the consumption measurement of the battery. This is like the consumption measurement for the battery. Default unit: KWT, The unit code (text) of measurement given using the UN/CEFACT Common Code (max. 3 characters)."},
 {"dcPowerOutput": "A instantaneous measurement present only if battery take input in DC. Default unit: KWT, The unit code (text) of measurement given using the UN/CEFACT Common Code (max. 3 characters)."},
 {"refBattery": "A Reference to an an entity or list of entities of type Battery"},
 {"source": "A sequence of characters giving the source of the entity data"},
 {"status": "The battery can be no giving (or not) energy and the same time consuming (or not energy)"},
 {"statusPercent": "A measure in percentage of the remaining energy stored in the battery. Allowed values: Any positive integer between 0 number and 100."}], "descriptionMissing": []}]